{
  template_id: "sample_bundle_v1",
  template_desc: "Sample bundle demonstrating sections, translations, and inputs",

  docs: [

    // ================================================================
    // Document 1: single section, no inputs
    // ================================================================
    {
      doc_identity: {
        id: "acknowledgement",
        label: "Acknowledgement",
        ver: "v1.0"
      },

      doc_hash: {
        algo: "sha256",
        hash: "d700d4f72457a3a100b3001e759e8ae607465203f4ae9d6c32021bc7abd375db"
      },

      doc_about: "This is a sample \"About\" notice.\n\nThe About section exists to explain what this application is and, just as importantly, what it is not. It provides orientation rather than instruction or persuasion, helping users form an accurate mental model before relying on the tool for anything meaningful. This section is intentionally descriptive, not authoritative: it explains scope, intent, and limitations, but it does not define obligations, guarantees, or enforceable terms.\n\nOne of the primary purposes of the About section is to describe the core responsibilities of the application in plain language. For example, it may explain that the app is designed to locally generate, store, and use cryptographic keys for signing and verification, and that these operations occur entirely on the user’s machine. It can also outline the kinds of guarantees the app attempts to uphold—such as user control, transparency, and minimal automation—along with the assumptions it makes about responsible use, including secure backups and careful handling of key material.\n\nIt is equally important for the About section to clarify boundaries and non-goals. This is where the application can explicitly state what it does not do: it is not a cloud service, not a recovery mechanism, not a password manager, and not a substitute for operational security practices. By naming these limits directly, the About section reduces the risk of users inferring capabilities that were never intended to exist.\n\nThe About section is also non-canonical. Its contents are not signed, hashed, or incorporated into any cryptographic operation performed by the application. Only the actual document text selected for signing constitutes the signed payload. As a result, any validating authority, arbiter, mediator, or third party must treat the About section as explanatory context only. It cannot be considered part of an agreement, declaration, or attestation, and it carries no binding or evidentiary weight with respect to signed material.\n\nFinally, the About section can communicate design philosophy and intent. It provides space to explain why certain choices were made—such as favoring explicit user actions over automation, or local simplicity over networked convenience—without those explanations becoming entangled with signed content. In this way, the About section helps users understand how to use the tool wisely, while keeping a clear and intentional separation between guidance and what is actually committed to by a cryptographic signature.",

      sections: [
        {
          section_id: "main",
          title: "Baseline",
          text: "And blood-black nothingness began to spin... Cells interlinked within cells interlinked... Within one stem... And dreadfully distinct... Against the dark, a tall white fountain played..."
        }
      ]
    },

    // ================================================================
    // Document 2: two sections, Latin + English translation
    // ================================================================
    {
      doc_identity: {
        id: "latin_attestation",
        label: "Latin Attestation",
        ver: "v1.0"
      },

      doc_hash: {
        algo: "sha256",
        hash: "d6b838db27498cf7b47c5a390fa8b4127a4cb5c3f635e0ed5d59f32054eb2d96"
      },

      sections: [
        {
          section_id: "nicene_creed",
          title: "SYMBOLVM NICÆNVM",

          text: "CREDO IN VNVM DEVM, \n\
\n\
PATREM OMNIPOTENTEM, FACTOREM CÆLI ET TERRÆ, VISIBILIVM OMNIVM ET INVISIBILIVM. \n\
\n\
ET IN VNVM DOMINVM IESVM CHRISTVM, FILIVM DEI VNIGENITVM, ET EX PATRE NATVM ANTE OMNIA SÆCVLA. DEVM DE DEO, LVMEN DE LVMINE, DEVM VERVM DE DEO VERO. GENITVM, NON FACTVM, CONSVBSTANTIALEM PATRI, PER QVEM OMNIA FACTA SVNT. QVI PROPTER NOS HOMINES ET PROPTER NOSTRAM SALVTEM DESCENDIT DE CÆLIS, ET INCARNATVS EST DE SPIRITV SANCTO EX MARIA VIRGINE, ET HOMO FACTVS EST. CRVCIFIXVS ETIAM PRO NOBIS SVB PONTIO PILATO, PASSVS ET SEPVLTVS EST, ET RESVRREXIT TERTIA DIE SECVNDVM SCRIPTURAS, ET ASCENDIT IN CÆLVM, SEDET AD DEXTERAM PATRIS. ET ITERVM VENTVRVS EST CVM GLORIA IVDICARE VIVOS ET MORTVOS, CVIVS REGNI NON ERIT FINIS. \n\
\n\
ET IN SPIRITVM SANCTVM, DOMINVM ET VIVIFICANTEM, QVI EX PATRE PROCEDIT, QVI CVM PATRE ET FILIO SIMVL ADORATVR ET CONGLORIFICATVR, QVI LOCVTVS EST PER PROPHETAS. \n\
\n\
ET VNAM, SANCTAM, CATHOLICAM ET APOSTOLICAM ECCLESIAM. CONFITEOR VNVM BAPTISMA IN REMISSIONEM PECCATORVM. ET EXPECTO RESVRRECTIONEM MORTVORVM, ET VITAM VENTVRI SÆCVLI. \n\
\n\
AMEN.",

          translation: {
            lang: "en",
            text: "The Nicene Creed:\n\
\n\
I believe in one God,\n\
the Father almighty,\n\
maker of heaven and earth,\n\
of all things visible and invisible.\n\
\n\
And in one Lord Jesus Christ,\n\
the only-begotten Son of God,\n\
born of the Father before all ages.\n\
God from God, Light from Light,\n\
true God from true God.\n\
Begotten, not made, consubstantial with the Father;\n\
through him all things were made.\n\
For us men and for our salvation\n\
he came down from heaven,\n\
and by the Holy Spirit was incarnate of the Virgin Mary,\n\
and became man.\n\
For our sake he was crucified under Pontius Pilate,\n\
he suffered and was buried,\n\
and rose again on the third day\n\
in accordance with the Scriptures.\n\
He ascended into heaven\n\
and is seated at the right hand of the Father.\n\
He will come again in glory\n\
to judge the living and the dead,\n\
and his kingdom will have no end.\n\
\n\
And in the Holy Spirit,\n\
the Lord, the giver of life,\n\
who proceeds from the Father,\n\
who with the Father and the Son\n\
is adored and glorified,\n\
who has spoken through the prophets.\n\
\n\
And one, holy, catholic, and apostolic Church.\n\
I confess one baptism for the forgiveness of sins.\n\
And I look forward to the resurrection of the dead\n\
and the life of the world to come. \n\
\n\
Amen."
          },

          inputs_spec: [
            {
              key: "ack_read_nicene_creed",
              label: "I acknowledge I have read this section",
              type: "bool",
              required: true
            }
          ],
        },
      ]
    },

    // ================================================================
    // Document 3: one section, all input types + validations
    // ================================================================
    {
      doc_identity: {
        id: "declarant_information",
        label: "Declarant Information",
        ver: "v1.0"
      },

      doc_hash: {
        algo: "sha256",
        hash: "3dc34fc16e6d781d752a296c38a00cf15138415ae48c98aa14317439bcdf9476"
      },

      sections: [
        {
          section_id: "info",

		  text: "This agreement records the declarant's provided information.\n\n\
		  Person ID: [[person_id]]\n\
		  Email: [[email]]\n\
		  Role: [[role]]\n\
		  Birth date: [[birth_date]]\n\
		  Score: [[score]]\n\
		  Attempts: [[attempts]]\n\
		  Metadata: [[metadata]]\n",

          inputs_spec: [

            {
              key: "person_id",
              label: "Person UUID",
              type: "string",
              required: true,
              validators: ["uuid"]
            },

            {
              key: "email",
              label: "Email Address",
              type: "string",
              required: true,
              validators: ["regex:^.+@.+\\..+$"]
            },

            {
              key: "role",
              label: "Role",
              type: "enum",
              required: true,
              choices: ["member", "admin", "observer"]
            },

            {
              key: "birth_date",
              label: "Date of Birth YYYY-MM-DD",
              type: "date",
              required: true
              // Expected format: YYYY-MM-DD
            },

            {
              key: "score",
              label: "Numeric Score",
              type: "number",
              required: true
            },

            {
              key: "attempts",
              label: "Attempt Count",
              type: "int",
              required: true
            },

            {
              key: "metadata",
              label: "Metadata JSON",
              type: "json",
              required: true,
              schema: {
                type: "object",
                required: ["source", "confirmed"],
                properties: {
                  source: { type: "string" },
                  confirmed: { type: "boolean" }
                },
                additionalProperties: false
              }
,
            sample_json: {
              source: "abc",
              confirmed: false
            }
            }

          ]
        }
      ]
    }

  ]
}